import React from 'react'
import Title from '../layouts/CustomTitle'

const Payment: React.FC = () => {
    return (
        <>
            <Title>Оплата </Title>

            <main className='payment'>
                <h1>Оплата</h1>
                <hr />
                <h2>Мы стараемся найти наиболее выгодный и удобный для Вас способ доставки. Стоимость доставки зависит от вида товара, его габаритов, веса, выбранного способа доставки и рассчитывается менеджером либо оплачивается по тарифам курьерской службы</h2>
                <hr />
                <section className='payment__container'>
                    <div className='payment__wrapper'>
                        <div className='payment__svg'>
                            <svg version='1.1' id='Layer_1' xmlns='http://www.w3.org/2000/svg' x='0px' y='0px' viewBox='0 0 100.176 100.178'>
                                <path d='M86.892,21.638H70.136l-1.567-5.716c-0.111-0.409-0.392-0.751-0.77-0.942c-0.378-0.191-0.82-0.214-1.214-0.062L48.733,21.77
	c-0.187-0.084-0.393-0.132-0.611-0.132H26.666c-0.407,0-0.797,0.166-1.08,0.459L12.364,35.809c-0.286,0.225-0.479,0.541-0.546,0.892
	c-0.008,0.036-0.01,0.074-0.015,0.111c-0.005,0.048-0.013,0.094-0.014,0.143c-0.001,0.019-0.006,0.038-0.006,0.057c0,0,0,0,0,0
	c0,0.001,0,0.002,0,0.004V83.86c0,0.828,0.671,1.5,1.5,1.5H80.2c0.828,0,1.5-0.672,1.5-1.5v-5.188h5.191c0.828,0,1.5-0.672,1.5-1.5
	V23.138C88.392,22.309,87.72,21.638,86.892,21.638z M70.832,35.517h-49.54l44.822-17.206L70.832,35.517z M27.303,24.638h13.959
	l-22.161,8.507L27.303,24.638z M78.7,82.36H14.783V38.517H78.7V82.36z M85.392,75.672H81.7V37.017c0-0.829-0.672-1.5-1.5-1.5h-6.259
	l-2.983-10.879h14.433V75.672z'/>
                            </svg>
                        </div>
                        <h2>Наличный расчёт</h2>
                        <p>Оплата может быть произведена при получении товара в офисе либо нашему представителю при доставке</p>
                    </div>
                    <div className='payment__wrapper'>
                        <div className='payment__svg'>
                            <svg version='1.1' id='Layer_1' xmlns='http://www.w3.org/2000/svg' x='0px' y='0px' viewBox='0 0 100.353 100.352'>
                                <g>
                                    <path d='M41.779,73.231c7.675,0,13.92-6.245,13.92-13.92s-6.245-13.92-13.92-13.92s-13.92,6.245-13.92,13.92
		S34.104,73.231,41.779,73.231z M41.779,48.391c6.021,0,10.92,4.898,10.92,10.92s-4.898,10.92-10.92,10.92s-10.92-4.898-10.92-10.92
		S35.757,48.391,41.779,48.391z'/>
                                    <rect x='10.985' y='46.891' width='3' height='24.84' />
                                    <rect x='69.102' y='46.891' width='3' height='24.84' />
                                    <path d='M96.683,19.21H20.434v8.898h-8.201v9.726H3.318v42.954h76.249v-9.726h8.915v-8.898h8.2V19.21H96.683z M76.567,77.788H6.318
		V40.834h70.249V77.788z M85.482,68.063h-5.915V37.834H15.233v-6.726h70.25L85.482,68.063L85.482,68.063z M93.683,59.164h-5.2
		V28.108H23.434V22.21h70.249L93.683,59.164L93.683,59.164z'/>
                                </g>
                            </svg>
                        </div>
                        <h2>Безналичный расчет</h2>
                        <p>При появлении необходимости мы выставим счет-фактуру с указанием реквизитов для оплаты заказа</p>
                    </div>
                    <div className='payment__wrapper'>
                        <div className='payment__svg'>
                            <svg id='Слой_1' data-name='Слой 1' xmlns='http://www.w3.org/2000/svg' viewBox='0 0 100 100'><path d='M90,21.5H10A1.5,1.5,0,0,0,8.5,23V71A1.5,1.5,0,0,0,10,72.5H38.5V82a1.49,1.49,0,0,0,.09.5H30a1.5,1.5,0,0,0,0,3H70a1.5,1.5,0,0,0,0-3H60.41a1.48,1.48,0,0,0,.09-.5V72.5H90A1.5,1.5,0,0,0,91.5,71V23A1.5,1.5,0,0,0,90,21.5Zm-32.41,61H41.41a1.49,1.49,0,0,0,.09-.5V72.5h16V82A1.48,1.48,0,0,0,57.59,82.5Zm30.91-13h-77v-45h77Z' /><path d='M43.5,54.15a1.5,1.5,0,0,0-3,0c0,3.79,3.25,6.93,7.5,7.54V64a1.5,1.5,0,0,0,3,0V61.69c4.25-.61,7.5-3.76,7.5-7.54s-3.25-6.93-7.5-7.54V37.35c2.58.52,4.5,2.34,4.5,4.5a1.5,1.5,0,0,0,3,0c0-3.79-3.25-6.93-7.5-7.54V32a1.5,1.5,0,0,0-3,0v2.31c-4.25.61-7.5,3.76-7.5,7.54s3.25,6.92,7.5,7.53v9.27C45.42,58.14,43.5,56.32,43.5,54.15Zm12,0c0,2.17-1.92,4-4.5,4.5v-9C53.58,50.17,55.5,52,55.5,54.15Zm-12-12.3c0-2.16,1.92-4,4.5-4.5v9C45.42,45.83,43.5,44,43.5,41.85Z' /></svg>
                        </div>
                        <h2>Перевод на платежную карту</h2>
                        <p>В случае оплаты данным способом, наш менеджер предоставит необходимую информацию</p>
                    </div>
                </section>
            </main>
        </>
    )
}

export default Payment;